tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "homebrew/x11"
cask "java"
brew "brew-cask-completion"
brew "autoconf"
brew "automake"
brew "bash"
brew "bashdb"
brew "llvm"
brew "castxml"
brew "ccache"
brew "cmake"
brew "curl"
brew "czmq"
brew "espeak"
brew "findutils"
brew "gmp"
brew "mpfr"
brew "gcc"
brew "gdb"
brew "gdbm"
brew "geos"
brew "gettext"
brew "perl"
brew "git"
brew "glib"
brew "gnu-tar"
brew "gnutls"
brew "go"
brew "gradle"
brew "libtool"
brew "hadoop"
brew "htop"
brew "xz"
brew "imagemagick"
brew "oniguruma"
brew "jq"
brew "libevent"
brew "libgcrypt"
brew "libidn"
brew "libsodium"
brew "libxml2"
brew "libxmlsec1"
brew "libyaml"
brew "lzip"
brew "lzlib"
brew "makedepend"
brew "maven"
brew "node"
brew "oath-toolkit"
brew "pixman"
brew "pkg-config"
brew "proj"
brew "sqlite"
brew "python"
brew "qcachegrind", args: ["with-graphviz"]
brew "redis"
brew "ruby"
brew "selenium-server-standalone"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "wget"
cask "ganttproject"
cask "google-chrome"
cask "openoffice"
cask "scala-ide"
cask "sublime-text"
cask "thunderbird"
cask "vlc"
cask "xmind"
cask "adobe-acrobat-reader"
cask "intellij-idea"
cask "telegram" 
cask "disk-inventory-x"
cask "flash-player"
# brew "ddd"
# brew "elasticsearch"
# brew "jenkins"
